<template>
  <q-page class="app-page-y">
    <div class="tw-container">
      <h1 class="tw-text-md1 app-h1--space">Опросы</h1>
      <AppTabs
        class="tw-mb-7-1"
        @switch="changeStep"
        :value="step"
        :steps="[
          { name: 'processing', label: 'Актуальные' },
          { name: 'finished', label: 'Завершённые' },
        ]"
      />
      <PollsList
        :items="[
          {
            id: 1,
            till: '25.02.2022',
            title: 'Покупаем ножи для Игры в Крокодила',
            text: 'Миллиардер Стернлихт поспорил с главой JPMorgan о бесполезности биткоина',
            description:
              'За последние сутки первая криптовалюта подорожала на 3%, а ее капитализация увеличилась до $1,1 трлн Утром 15 октября цена биткоина на криптобирже Bitfinex впервые с середины апреля превысила $60 тыс. За прошедшие сутки главная криптовалюта подорожала на 3%. На 9:30 мск биткоин торгуется на уровне $59,5 тыс. Капитализация криптовалюты увеличилась до $1,1 трлн, по данным CoinGecko. Доля биткоина на крипторынке составляет 44,2%. Последняя волна роста биткоина стартовала 29 сентября, с локального ценового минимума в $40,7 тыс. За более чем две недели криптовалюта подорожала на 47%. Ее цена приближается к историческому максимуму в $64,8 тыс., установленному в середине апреля. Ранее аналитическая компания B2C2 сообщила, что рост стоимости биткоина в начале октября вызван повышенным спросом на криптовалюту со стороны институциональных инвесторов. Аналитики утверждают, что в последние недели рынок «активно смещен в сторону покупателей». — Банк России изучит объем инвестиций россиян в криптовалюту — В Fidelity спрогнозировали подорожание биткоина до $100 тыс. к 2023 году — Glassnode: отток биткоинов с криптобирж замедлилсяa',
            variants: [
              { label: 'Покупаем', total: '10%' },
              { label: 'Нет', total: '70%' },
              { label: 'Да', total: '10%' },
              { label: 'Что-то среднее', total: '16%' },
            ],
          },
          {
            id: 2,
            till: '25.02.2022',
            title: 'Покупаем ножи для Игры в Крокодила',
            text: 'Миллиардер Стернлихт поспорил с главой JPMorgan о бесполезности биткоина',
            description:
              'За последние сутки первая криптовалюта подорожала на 3%, а ее капитализация увеличилась до $1,1 трлн Утром 15 октября цена биткоина на криптобирже Bitfinex впервые с середины апреля превысила $60 тыс. За прошедшие сутки главная криптовалюта подорожала на 3%. На 9:30 мск биткоин торгуется на уровне $59,5 тыс. Капитализация криптовалюты увеличилась до $1,1 трлн, по данным CoinGecko. Доля биткоина на крипторынке составляет 44,2%. Последняя волна роста биткоина стартовала 29 сентября, с локального ценового минимума в $40,7 тыс. За более чем две недели криптовалюта подорожала на 47%. Ее цена приближается к историческому максимуму в $64,8 тыс., установленному в середине апреля. Ранее аналитическая компания B2C2 сообщила, что рост стоимости биткоина в начале октября вызван повышенным спросом на криптовалюту со стороны институциональных инвесторов. Аналитики утверждают, что в последние недели рынок «активно смещен в сторону покупателей». — Банк России изучит объем инвестиций россиян в криптовалюту — В Fidelity спрогнозировали подорожание биткоина до $100 тыс. к 2023 году — Glassnode: отток биткоинов с криптобирж замедлилсяa',
            variants: [
              { label: 'Покупаем', total: '10%' },
              { label: 'Нет', total: '70%' },
              { label: 'Да', total: '10%' },
              { label: 'Что-то среднее', total: '16%' },
            ],
          },
        ]"
      >
        <template v-slot:item="{ item }">
          <PollsItem v-bind="{ item }">
            <template v-slot:variants="{ variants }">
              <VariantsList
                class="tw-mb-12"
                v-bind="{ variants }"
                :initialValue="{
                  selected: { label: 'Покупаем' },
                  winner: { label: 'Да' },
                }"
              />
              <!-- @selected="update" -->
            </template>
          </PollsItem>
        </template>
      </PollsList>
    </div>
  </q-page>
</template>

<script>
import PollsList from 'src/components/PollsList.vue';
import PollsItem from 'src/components/PollsItem.vue';
import AppTabs from 'src/components/AppTabs.vue';
import VariantsList from 'src/components/VariantsList.vue';
import useStep from 'src/composition/useStep';
import { computed } from 'vue';

export default {
  setup() {
    const { step, changeStep } = useStep('processing');
    const list = computed(() => {});

    return {
      step,
      changeStep,
    };
  },

  components: {
    PollsList,
    AppTabs,
    PollsItem,
    VariantsList,
  },
};
</script>

<style>
</style>
