export default {
  buttons: {
    close: "Закрыть",
  },
  lk: {
    menu: {
      wallet: "Кошелек",
      history: "История операций",
      output: "Вывод",
    },
  },
  landing: {
    header: {
      auth: "Авторизоваться",
      registr: "Зарегистрироваться",
      promoText: "Законные безусловные <br /> глобальные активы",
      lk: "Личный кабинет",
      logout: "Выйти",
    },
    footer: {
      serviceInfo: "Условия обслуживания",
      whyAlga: "Почему Alga",
    },
    menu: {
      about: "О токене",
      features: "Фишки проекта",
      owners: "Резиденты",
      ecosystem: "Экосистема",
      projects: "Проекты",
      news: "Новости",
    },
    about: {
      header: "О ТОКЕНЕ",
      body: "AlgaCoin — это токен, управляемый сообществом со множеством будущих проектов и партнёрств, направленный на повышение уровня жизни участников сообщества путём создания экологичных бизнес-проектов",
      bottom: "монет",
      wallets: "кошельков",
    },
  },
};
